<a href="https://colab.research.google.com/github/isaiastrajano/BootCamp_Python_DataScience/blob/main/Exercicio_estatisticadescritiva.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Exercícios de estatística descritiva

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Exercicio 1



Os dados abaixo referem-se a quantidade produzida de lavouras permanentes no Brasil, entre 2017 e 2019. Construa o DataFrame abaixo e seguidamente faça:

a) obtenha a quantidade total produzida pelas lavouras em cada ano;

b) obtenha a quantidade total produzida por cada lavoura ao longo do tempo;

c) mostre um resumo das estatísticas descritivas;

d) converta o banco de dados para csv.

In [2]:
dados = { 'Abacate':{ 2017: 212873, 2018: 236177, 2019: 242932 }, 'Açaí':{ 2017:1335040, 2018:1301472, 2019:1398328 }, 'Banana':{ 2017:6584967, 2018:6723590, 2019:6812708 }, 'Cacau':{ 2017:235809, 2018:239318, 2019:259425 }, 'Laranja':{ 2017:17492882, 2018:16841549, 2019:17073593 }, 'Maçã':{ 2017:1307642, 2018:1203007, 2019:1222970 }, 'Mamão':{ 2017:1058487, 2018:1065421, 2019:1161808 }, 'Manga':{ 2017:1089882, 2018:1320458, 2019:1414338 }, }

In [3]:
dados

{'Abacate': {2017: 212873, 2018: 236177, 2019: 242932},
 'Açaí': {2017: 1335040, 2018: 1301472, 2019: 1398328},
 'Banana': {2017: 6584967, 2018: 6723590, 2019: 6812708},
 'Cacau': {2017: 235809, 2018: 239318, 2019: 259425},
 'Laranja': {2017: 17492882, 2018: 16841549, 2019: 17073593},
 'Mamão': {2017: 1058487, 2018: 1065421, 2019: 1161808},
 'Manga': {2017: 1089882, 2018: 1320458, 2019: 1414338},
 'Maçã': {2017: 1307642, 2018: 1203007, 2019: 1222970}}

In [4]:
data = pd.DataFrame(dados)

In [5]:
#a
data['total'] = data.sum(axis=1)
#somando os valores do eixo x
data

      Abacate     Açaí   Banana   Cacau  ...     Maçã    Mamão    Manga     total
2017   212873  1335040  6584967  235809  ...  1307642  1058487  1089882  29317582
2018   236177  1301472  6723590  239318  ...  1203007  1065421  1320458  28930992
2019   242932  1398328  6812708  259425  ...  1222970  1161808  1414338  29586102

[3 rows x 9 columns]

In [6]:
#b
datat = data.T
datat['total'] = datat.sum(axis=1)
datat

             2017      2018      2019     total
Abacate    212873    236177    242932    691982
Açaí      1335040   1301472   1398328   4034840
Banana    6584967   6723590   6812708  20121265
Cacau      235809    239318    259425    734552
Laranja  17492882  16841549  17073593  51408024
Maçã      1307642   1203007   1222970   3733619
Mamão     1058487   1065421   1161808   3285716
Manga     1089882   1320458   1414338   3824678
total    29317582  28930992  29586102  87834676

In [7]:
#c
data.describe()

             Abacate          Açaí  ...         Manga         total
count       3.000000  3.000000e+00  ...  3.000000e+00  3.000000e+00
mean   230660.666667  1.344947e+06  ...  1.274893e+06  2.927823e+07
std     15770.488906  4.918209e+04  ...  1.669583e+05  3.293235e+05
min    212873.000000  1.301472e+06  ...  1.089882e+06  2.893099e+07
25%    224525.000000  1.318256e+06  ...  1.205170e+06  2.912429e+07
50%    236177.000000  1.335040e+06  ...  1.320458e+06  2.931758e+07
75%    239554.500000  1.366684e+06  ...  1.367398e+06  2.945184e+07
max    242932.000000  1.398328e+06  ...  1.414338e+06  2.958610e+07

[8 rows x 9 columns]

In [8]:
#d
data.to_csv('dados_prod.csv', index = False)

# Exercício 2


Com base no dataset anterior obtenha:

a) média da quantidade total produzida das respectivas lavouras em 2017, 2018 e 2019;

b) média da quantidade produzida de cada lavoura entre o período selecionado;

c) desvio padrão da quantidade total produzida das respectivas lavouras em 2017, 2018 e 2019;

d) desvio padrão da quantidade produzida de cada lavoura entre o período selecionado;

e) variância da quantidade total produzida das respectivas lavouras em 2017, 2018 e 2019;

In [9]:
#a
datat.drop(labels = ['total'], axis = 1, inplace = True)
datat['Média'] = datat.median(axis=1)
datat

             2017      2018      2019       Média
Abacate    212873    236177    242932    236177.0
Açaí      1335040   1301472   1398328   1335040.0
Banana    6584967   6723590   6812708   6723590.0
Cacau      235809    239318    259425    239318.0
Laranja  17492882  16841549  17073593  17073593.0
Maçã      1307642   1203007   1222970   1222970.0
Mamão     1058487   1065421   1161808   1065421.0
Manga     1089882   1320458   1414338   1320458.0
total    29317582  28930992  29586102  29317582.0

In [10]:
#c
#datat.drop(labels = ['Média'], axis = 1, inplace = True)
#datat.drop(labels = ['total'], axis = 1, inplace = True)
datat['Média Std'] = datat.std(axis=1)
datat

             2017      2018      2019       Média      Média Std
Abacate    212873    236177    242932    236177.0   13168.638132
Açaí      1335040   1301472   1398328   1335040.0   40461.347679
Banana    6584967   6723590   6812708   6723590.0   94066.763165
Cacau      235809    239318    259425    239318.0   10766.168136
Laranja  17492882  16841549  17073593  17073593.0  271343.884490
Maçã      1307642   1203007   1222970   1222970.0   46622.795865
Mamão     1058487   1065421   1161808   1065421.0   49457.302537
Manga     1089882   1320458   1414338   1320458.0  138211.549291
total    29317582  28930992  29586102  29317582.0  269610.637324

In [11]:
#e
#datat.drop(labels = ['Média Std'], axis = 1, inplace = True)
datat['Variancia'] = np.var(datat, axis = 1)
datat

             2017      2018      2019       Média      Média Std     Variancia
Abacate    212873    236177    242932    236177.0   13168.638132  7.768778e+09
Açaí      1335040   1301472   1398328   1335040.0   40461.347679  2.722185e+11
Banana    6584967   6723590   6812708   6723590.0   94066.763165  7.011171e+12
Cacau      235809    239318    259425    239318.0   10766.168136  8.733532e+09
Laranja  17492882  16841549  17073593  17073593.0  271343.884490  4.546671e+13
Maçã      1307642   1203007   1222970   1222970.0   46622.795865  2.288425e+11
Mamão     1058487   1065421   1161808   1065421.0   49457.302537  1.739673e+11
Manga     1089882   1320458   1414338   1320458.0  138211.549291  2.223527e+11
total    29317582  28930992  29586102  29317582.0  269610.637324  1.347749e+14

# Exercício 3

Calcule e imprima na tela:

a) média das vendas diárias;

b) desvio padrão;

c) variância;

d) moda;

e) quantidade total vendida no período;

f) valor máximo de vendas e o dia respectivo;

g) valor mínimo de vendas e o dia rescpetivo.

In [12]:
#criando o dataset
datalista = pd.date_range(start ='12-1-2020', end ='12-10-2020')
vendas = [10, 38, 47, 9, 11, 9, 21, 49, 17, 29]
dataset = pd.DataFrame(index = datalista, data = vendas)
dataset.rename({0: 'Venda Diaria'}, axis = 1, inplace = True)
dataset

            Venda Diaria
2020-12-01            10
2020-12-02            38
2020-12-03            47
2020-12-04             9
2020-12-05            11
2020-12-06             9
2020-12-07            21
2020-12-08            49
2020-12-09            17
2020-12-10            29

In [13]:
#a, b
dataset.describe()

       Venda Diaria
count     10.000000
mean      24.000000
std       15.804359
min        9.000000
25%       10.250000
50%       19.000000
75%       35.750000
max       49.000000

In [14]:
dataset.var()

Venda Diaria    249.777778
dtype: float64

In [15]:
dataset.mode()

   Venda Diaria
0             9

In [16]:
dataset.max()

Venda Diaria    49
dtype: int64

In [17]:
dataset.min()

Venda Diaria    9
dtype: int64

In [18]:
dataset.loc[dataset['Venda Diaria'].idxmax()]
#ou
#dataset[dataset['Venda Diaria']==dataset['Venda Diaria'].max()]

Venda Diaria    49
Name: 2020-12-08 00:00:00, dtype: int64

In [19]:
dataset.loc[dataset['Venda Diaria'].idxmin()]
#ou
#dataset[dataset['Venda Diaria']==dataset['Venda Diaria'].min()]

Venda Diaria    9
Name: 2020-12-04 00:00:00, dtype: int64

Resposta do curso

print('Estatísticas descritivas das vendas diárias'.center(100, ' '))

print(f'\tMédia das vendas diárias: {df.mean()[0]}')

print(f'\tDesvio padrão das vendas: {df.std()[0].round(2)}')

print(f'\tVariância das vendas: {df.var()[0].round(2)}')

print(f'\tValor modal: {df.mode().iloc[0][0]}')

print(f'\tQuantidade vendida no período: {df.sum()[0]}')

print(f'\tValor máximo: {df.max()[0]}')

print(f"\t\tDia: {data_valor_max.strftime('%d/%m/%Y')}")

print(f'\tValor mínimo: {df.min()[0]}')

print(f"\t\tDia: {data_valor_min.strftime('%d/%m/%Y')}")

# Exercício 4

O objetivo deste exercício é identificar o perfil de cada consumidor de esteira da empresa CardioGoodFitness.

Significado das colunas:

Product: produtos adquiridos;
Age: idade dos clientes, em anos;
Gender: gênero;
Education: educação em anos;
MaritalStatus: status civil;
Usage: número médio de vezes que o cliente planeja usar a esteira por semana;
Fitness: índice de autoavaliação fitness, em uma escala de 1 a 5, sendo 1 denotando má forma e 5 excelente forma;
Income: renda familiar anual;
Miles: número médio de milhas que cada cliente espera andar/correr por semana.

Com base nestas informações:

Leia o dataset e armazene em uma variável;

Mostre as 3 primeiras linhas do dataset;

Mostre as duas últimas linhas do dataset;

Mostre o shape do dataset;

Obtenha informações das colunas com o método info();

Mostre estatísticas descritivas das colunas numéricas;

Mostre o tipo de dado de cada coluna;

Converta o dtype da coluna Income para float.

In [20]:
%cd ..
from google.colab import drive
drive.mount('/content/gdrive')

/
Mounted at /content/gdrive

In [21]:
!ln -s /content/gdrive/My\ Drive/ /mydrive
!ls /mydrive

'Bakcup de fotos'				       kaggle_titanic
'Colab Notebooks'				      'Material estudo'
'Conteúdo profissional'				      'Minhas fotos'
'Copy of Aula de Machine Learning_Kmeans_IGTI.ipynb'  'My Drive'
 Currículo.gdoc					      'Rascunho Curriculo.gdoc'
'Ds160 wesley.pdf'

In [22]:
!ls /mydrive/kaggle_titanic/dataset/

CardioGoodFitness.csv  gender_submission.csv  test.csv	train.csv

In [26]:
dt = pd.read_csv("/mydrive/kaggle_titanic/dataset/CardioGoodFitness.csv")

In [37]:
dt.head(3)

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66

In [38]:
dt.tail(2)

    Product  Age Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
178   TM798   47   Male         18     Partnered      4        5  104581    120
179   TM798   48   Male         18     Partnered      4        5   95508    180

In [40]:
dt.shape

(180, 9)

In [41]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

In [83]:
dt.describe().round(2)

          Age  Education   Usage  Fitness     Income   Miles
count  180.00     180.00  180.00   180.00     180.00  180.00
mean    28.79      15.57    3.46     3.31   53719.58  103.19
std      6.94       1.62    1.08     0.96   16506.68   51.86
min     18.00      12.00    2.00     1.00   29562.00   21.00
25%     24.00      14.00    3.00     3.00   44058.75   66.00
50%     26.00      16.00    3.00     3.00   50596.50   94.00
75%     33.00      16.00    4.00     4.00   58668.00  114.75
max     50.00      21.00    7.00     5.00  104581.00  360.00

In [79]:
dt['Income'] = pd.to_numeric(dt['Income'], downcast='float')
#ou
#dt['Income'] = dt['Income'].astype(float)
df = df.astype(int)

In [80]:
dt.dtypes

Product           object
Age                int64
Gender            object
Education          int64
MaritalStatus     object
Usage              int64
Fitness            int64
Income           float32
Miles              int64
dtype: object

# Exercício 5

Verifique se há missing data no dataset do exercício anterior.

In [ ]:
dt.notna().sum()
#valores não nulos

In [ ]:
dt.notnull().sum()
#valores não nulos

In [ ]:
dt.isna().sum()
#valores nulos

# Exercício 6

Exercício 6

Ainda com base no dataset do exercício 4 responda:
Estatísticas descritivas

Qual a distribuição ordenada idade dos clientes (use a função value_counts())?

Qual a média e o desvio padrão da idade por gênero?

Qual a proporção de homens e mulheres?

Qual a distribuição do estado civil entre homens e mulheres?

Qual o nível de educação por gênero?